import React from 'react'
import '../style-pages.css';
import Imageone from '../../images/pages/laravel/1.webp'
import Imagetwo from '../../images/pages/laravel/2.png'
import Imagethree from '../../images/pages/laravel/3.jpg'
import Imagefour from '../../images/pages/laravel/4.jpg'
import Imagefive from '../../images/pages/laravel/5.png'
import Imagesix from '../../images/pages/laravel/6.svg'
import Imageseven from '../../images/pages/laravel/7.png'

import ArrowLeftIcon from '@material-ui/icons/ArrowLeft';
function Laravel() {
    return (
        <main className="page">
            <img className="img-page" src={Imageone} alt="laravel" />
            <div className="title">
                <h3>فریم ورک لاراول چیست </h3>
            </div>
            <p className="text-page">
            زبان برنامه نویسی PHP یکی از برترین و محبوب‌ترین زبان‌های برنامه ‌نویسی در حوزه طراحی وب است. این زبان برنامه نویسی Framework ‌های بسیار زیادی دارد که لاراول یکی از آن‌ها است. عاملی که فریم ورک لاراول را از سایر فریم ورک‌های زبان PHP متمایز می‌سازد، ویژگی‌های زیادی است که در ادامه‌ی مقاله‌ی فریم ورک لاراول چیست، به‌طور کامل به توضیح هر کدام از آن‌ها می‌پردازبم.<br />
            </p>
            <br />
            <img className="img-page" src={Imagetwo} alt="laravel" />
            <div className="title">
                <h3 > Framework چیست؟ </h3>
            </div>
            <p className="text-page">
            شاید ابتدا برای شما این سوال پیش بیاید که فریم ورک چیست؟ فریم ورک یا Framework در لغت به معنی چارچوب است.
فریم ورک برنامه ‌نویسی مجموعه ای از کتابخانه‌ها، استاندارد‌ها، دیزاین پترن‌ها و قوانین کدنویسی است که در بستر یک چارچوب نرم‌ افزاری در اختیار توسعه‌ دهندگان و برنامه ‌نویسان قرار می‌گیرد. برای انواع زبان‌های برنامه‌ نویسی‌ مختلف، فریم ورک‌های متعددی توسعه داده شده است <br/>
نابراین برنامه ‌نویسان و توسعه ‌دهندگان از فریم ورک‌ها به‌عنوان بستری استاندارد برای طراحی و توسعه اپلیکیشن‌های خود استفاده می‌کنند. در فریم ورک‌ها بسیاری از کدها و دستورات به‌صورت از پیش نوشته‌ شده مورد استفاده قرار می‌گیرند. این توابع و دستورات توسط توسعه دهندگانی با تجربه و متخصص آماده شده اند و برنامه نویسان با استفاده از آن‌ها می‌توانند اپلیکیشن‌های خود را با سرعت، امنیت و کیفیت بالاتری توسعه دهند
            </p>
            <img className="img-page" src={Imagethree} alt="laravel" />
            <div className="title">
                <h3>  فریم ورک لاراول چیست؟ </h3>
                </div>
                <p className="text-page">
                زمانی که در مورد فریم ورک‌های توسعه وب اپلیکیشن صحبت می‌شود، همیشه نام لاراول به میان می‌آید. از لاراول می‌توان به عنوان محبوب‌ترین فریم ورک زبان برنامه نویسی PHP یاد کرد. این فریم ورک توانسته است در زمانی کوتاه، به اولین گزینه‌ی توسعه دهندگان برای توسعه برنامه‌های پیچیده تحت وب تبدیل شود <br />
                لاراول فریم ورکی مبتنی بر معماری MVC است که به صورت رایگان و متن باز ارائه شده است. این فریم‌ ورک امکانات هوشمندی در اختیار برنامه نویسان قرار می‌دهد و برنامه‌‌ نویسی را برای آن‌ها لذت بخش‌ تر می‌کند
                <br />
                ین فریم ورک در بین سایر فریم ورک‌های PHP از امنیت و سرعت توسعه‌ی بیشتری برخوردار است و از طریق آن شما قادر خواهید بود بدون اینکه تغییری در کدهای اصلی ایجاد کنید، عملکرد بسیاری از بخش‌ها را تغییر دهید <br />
                لاراول کتابخانه‌های بسیار متنوعی دارد و از اغلب کتابخانه‌های فریم ورک سیمفونی نیز استفاده می‌کند. همچنین این فریم ورک سرویس‌های مختلفی را برای برنامه نویسان ارائه می‌دهد. به عنوان مثال سرویس هایی همچون تأیید هویت، دسترسی‌های کاربران، کنسول Artisan، پرداخت و صورتحساب، کش (Cache) و ... که تنها بخش کوچکی از سرویس هایی است که این فریم ورک در اختیار برنامه‌ نویسان قرار می‌دهد.
                </p>
                <img className="img-page" src={Imagefour} alt="laravel" />
                <div className="title">
                <h3>   قابلیت‌ها و مزایای لاراول   </h3>
                </div>
                <p className="text-page">
                فریم ورک Laravel مزایای بسیار زیادی دارد که با هر بروزرسانی شمار آن‌ها افزایش می‌یابد. از Laravel تحت عنوان هایی مانند جادوگر دنیای وب هم یاد می‌شود. زیرا بسیاری بر این اعتقادند که کارهایی که این فریم ورک در فرآیند توسعه وب اپلیکیشن انجام می‌دهد، جادویی می‌باشند <br />
                در لاراول با کمترین میزان کدنویسی و با وارد کردن دستوراتی کوتاه، کارهای بزرگی را می‌توان انجام داد. از جمله می‌توان به سیستم پیاده سازی فرم‌های عضویت و ورود در Laravel اشاره کرد. این بخش در لاراول تنها با وارد کردن یک دستور پیاده سازی می‌شود. هم‌چنین برای این که فریم ورک Laravel پاسخگوی نیازهای مختلف ما باشد، از Composer استفاده می‌کند که برای بروز رسانی لاراول نیز دقیقا از همین ابزار استفاده می‌شود <br />
                 <ArrowLeftIcon />استفاده از معماری MVC<br />
                <ArrowLeftIcon />متن باز (Open Source) بودن<br />
                <ArrowLeftIcon />آسانی در یادگیری<br />
                <ArrowLeftIcon />افزایش سرعت توسعه پروژه<br />
                <ArrowLeftIcon />امنیت بالا<br />
                <ArrowLeftIcon />بروز رسانی آسان<br />
                <ArrowLeftIcon />آسان‌تر کردن اعمالی همچون احراز هویت (Authentication) ، مسیریابی (Routing) و Cache کردن<br />
                <ArrowLeftIcon />استفاده از Remote Component<br />
                <ArrowLeftIcon /> افزایش چشمگیر سرعت کد نویسی<br />
                <ArrowLeftIcon /> توسعه برنامه بدون به خطر افتادن قابلیت‌ها و کدهای قبلی برنامه<br />
                <ArrowLeftIcon />محدود کردن Eloquent با استفاده از دستوراتی ساده<br />
                <ArrowLeftIcon />قابلیت اجرای آزمایش‌‌های متعدد مانند Unit Testing با استفاده از دستوراتی ساده<br />
                <ArrowLeftIcon />قابلیت دسترسی آسان به Database توسط Migration ها<br />
                <ArrowLeftIcon />خط فرمان فوق العاده Artisan<br />
                <ArrowLeftIcon />قابلیت ایجاد Package‌های مختلف<br />
                <ArrowLeftIcon />استفاده کردن از موتور Template Blade<br />
                </p>
                <img className="img-page" src={Imagefive} alt="laravel" />
                <div className="title">
                <h3>   افزایش سرعت توسعه پروژه  </h3>
                </div>
                <p className="text-page">
                بی دلیل نیست که فریم ورک لاراول در بین برنامه نویسان زبان PHP محبوبیت زیادی پیدا کرده است. یکی از مهم‌ترین دلایلی که برنامه نویسان، فریم ورک لاراول را انتخاب می‌کنند، کمک به افزایش سرعت توسعه پروژه‌ها است <br />
                فریم ورک لاراول به صورت Component Base است. یعنی کاربران به راحتی می‌توانند کامپوننت‌های دلخواهشان را به اپلیکیشن اضافه کرده و به روند توسعه آن سرعت بخشند. همچنین در صورتی که از منطق اجرایی Laravel استفاده شود، نوشتن وب اپلیکیشن بسیار ساده خواهد شد.<br />
                همچنین استفاده از قابلیت Auto Loading باعث می‌شود تمام نیازمندی‌ها برای Component ها، Class‌‌ها و غیره به صورت اتوماتیک بارگذاری شود. ویژگی دیگر لاراول، استفاده از Migration ها برای ایجاد دیتابیس‌ است که باعث سهولت انتقال و مدیریت اطلاعات می‌شود. لاراول دارای سیستم‌های امنیتی متعددی است که باعث جلوگیری از انواع حملات، مدیریت ذخیره سازی کوئری‌های دیتابیس و ... می‌شود. این‌ها برخی از مهم‌ترین مواردی هستند که در لاراول باعث کاهش مشکلات و افزایش سرعت توسعه اپلیکیشن‌ها می‌شوند
                </p>
                <img className="img-page" src={Imagesix} alt="laravel" />
                <div className="title">
                <h3>   کاهش حجم کد نویسی با کمک لاراول  </h3>
                </div>
                <p className="text-page">
                در Laravel تمام کوئری‌های شما می‌توانند در Model‌های جداگانه ای ذخیره شوند که بعدها از آن‌ها استفاده کنید.
این ویژگی فوق العاده باعث شده است که در برنامه نویسی سایت با استفاده از فریم ورک لاراول حجم بسیار زیادی از کدهای شما کاهش یابد و شما بتوانید بهتر و راحت‌تر با برنامه‌ی خود تعامل داشته باشید و آن را اصلاح کنید.
                </p>
                <img className="img-page" src={Imageseven} alt="laravel" />
                <div className="title">
                <h3>   سیستم امنیتی بسیار بالا   </h3>
                </div>
                <p className="text-page">
                رای آن که مطمئن شویم کسی نمی‌تواند به وب سایت ما ریکوئست‌های Fake بفرستد و از این طریق از آن سوء استفاده کند، لاراول از توکن‌های CSRF استفاده می‌کند. چرا که در غیر این صورت هکرها می‌توانند از طریق این ریکوئست‌های Fake به وب ‌سایت ما نفوذ کنند. به این گونه حملات CSRF یا Cross Site Request Forgery گفته می‌شود.<br />
                پس نتیجه می‌گیریم که یکی دیگر از مزیت‌های مهم و بزرگ فریم ورک لاراول، همین سیستم امنیتی بسیار بالا و پیشرفته‌ آن است که از وب سایت شما در مقابل injection‌‌ها و حملات XSS و CSRF محافظت می‌کند و کسی که در حال برنامه نویسی با استفاده از فریم ورک لاراول می‌باشد دیگر نیازی نیست که نگران این موارد باشد
                </p>
        </main>
    )
}

export default Laravel